# 10 05 Pandas Data Joining and Merging

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'employee_id':[101, 102, 103, 104],
                    'name':['Alice', 'Bob', 'Charlie', 'David'],
                    'department': ['HR', 'Engineering', 'Marketing', 'Finance']
})

In [3]:
df1

   employee_id     name   department
0          101    Alice           HR
1          102      Bob  Engineering
2          103  Charlie    Marketing
3          104    David      Finance

In [4]:
df2 = pd.DataFrame({
    'emp_id': [101, 102, 103, 105],
    'salary':[70000, 80000, 65000, 95000],
    'join_date':['2020-01-15', '2019-03-22', '2021-07-30', '2018-05-10']
})

In [5]:
df2

   emp_id  salary   join_date
0     101   70000  2020-01-15
1     102   80000  2019-03-22
2     103   65000  2021-07-30
3     105   95000  2018-05-10

In [8]:
inner_merged= pd.merge(df1, df2, left_on='employee_id', right_on='emp_id')

In [9]:
inner_merged

   employee_id     name   department  emp_id  salary   join_date
0          101    Alice           HR     101   70000  2020-01-15
1          102      Bob  Engineering     102   80000  2019-03-22
2          103  Charlie    Marketing     103   65000  2021-07-30

In [10]:
left_merged = pd.merge(df1, df2, left_on='employee_id', right_on='emp_id', how='left')

In [11]:
left_merged

   employee_id     name   department  emp_id   salary   join_date
0          101    Alice           HR   101.0  70000.0  2020-01-15
1          102      Bob  Engineering   102.0  80000.0  2019-03-22
2          103  Charlie    Marketing   103.0  65000.0  2021-07-30
3          104    David      Finance     NaN      NaN         NaN

In [12]:
right_merged = pd.merge(df1, df2, left_on='employee_id', right_on='emp_id', how='right')

In [13]:
right_merged

   employee_id     name   department  emp_id  salary   join_date
0        101.0    Alice           HR     101   70000  2020-01-15
1        102.0      Bob  Engineering     102   80000  2019-03-22
2        103.0  Charlie    Marketing     103   65000  2021-07-30
3          NaN      NaN          NaN     105   95000  2018-05-10

In [14]:
outer_merged = pd.merge(df1, df2, left_on='employee_id', right_on='emp_id', how='outer')

In [15]:
outer_merged

   employee_id     name   department  emp_id   salary   join_date
0        101.0    Alice           HR   101.0  70000.0  2020-01-15
1        102.0      Bob  Engineering   102.0  80000.0  2019-03-22
2        103.0  Charlie    Marketing   103.0  65000.0  2021-07-30
3        104.0    David      Finance     NaN      NaN         NaN
4          NaN      NaN          NaN   105.0  95000.0  2018-05-10

In [17]:
mysql = "SELECT * FROM employees e RIGHT JOIN salaries s ON e.employee_id = s.emp_id;"

In [18]:
SFP300

NameError: name 'sfp300' is not defined